In [1]:
import pandas as pd
import numpy as np

### 1. 丢弃指定轴的数据

In [16]:
data=pd.DataFrame(np.arange(16).reshape(4,4),columns=['one','two','three','four'])
data

   one  two  three  four
0    0    1      2     3
1    4    5      6     7
2    8    9     10    11
3   12   13     14    15

In [7]:
# del data#清除指定的变量

In [13]:
data.drop(['one'],axis=1)

           two  three  four
Shenzhen     1      2     3
Guangzhou    5      6     7
Beijing      9     10    11
Shanghai    13     14    15

In [17]:
data.drop([0,1],axis=0)

   one  two  three  four
2    8    9     10    11
3   12   13     14    15

### 2 映射

In [18]:
data=pd.DataFrame(np.random.randn(3,4),columns=list('abcd'))
data

          a         b         c         d
0  0.538005  0.454864 -0.244821  0.836250
1  1.690276 -1.573336 -0.961098 -1.069557
2 -1.197836 -0.450930 -0.462636 -0.568006

借助numpy提供的函数

In [19]:
np.abs(data)

          a         b         c         d
0  0.538005  0.454864  0.244821  0.836250
1  1.690276  1.573336  0.961098  1.069557
2  1.197836  0.450930  0.462636  0.568006

#### 2.1 DataFrame对象的apply

针对DataFrame逐列进行映射处理，最后进行组合

In [25]:
data

          a         b         c         d
0  0.538005  0.454864 -0.244821  0.836250
1  1.690276 -1.573336 -0.961098 -1.069557
2 -1.197836 -0.450930 -0.462636 -0.568006

In [39]:
def f(s,n=2):    
    return s[:n]

In [43]:
data.apply(f,n=1,axis=0)#DataFrame的逐列映射处理

          a         b         c        d
0  0.538005  0.454864 -0.244821  0.83625

#### 2.2 DataFrame.applymap

DataFrame.applymap是DataFrame对象的逐元素映射处理

In [38]:
data

          a         b         c         d
0  0.538005  0.454864 -0.244821  0.836250
1  1.690276 -1.573336 -0.961098 -1.069557
2 -1.197836 -0.450930 -0.462636 -0.568006

In [54]:
# import math
# def func(elem,n=1):
#     return elem**n

In [57]:
func = lambda x:x**2
data.applymap(func)

          a         b         c         d
0  0.289449  0.206901  0.059937  0.699314
1  2.857033  2.475388  0.923709  1.143952
2  1.434810  0.203338  0.214032  0.322630

#### 2.3 Series.map/Series.apply

针对Series对象进行逐元素处理

In [58]:
s=pd.Series([2,1,3,7],index=list('abcd'))
s

a    2
b    1
c    3
d    7
dtype: int64

In [59]:
f=lambda x:x**2
s.map(f)

a     4
b     1
c     9
d    49
dtype: int64

In [60]:
s.apply(f)

a     4
b     1
c     9
d    49
dtype: int64

apply：
+ 针对DataFrame：逐列进行映射处理
+ 针对Series:逐元素进行映射处理 

applymap:
+ 只能针对DataFrame对象，逐元素映射处理  

map
+ 针对Series:逐元素进行映射处理

### 3. 排序

In [78]:
data=pd.DataFrame(np.random.randint(10,15,16).reshape(4,4),columns=['one','two','three','four'],index=['SH','SZ','GZ',np.nan])
data

     one  two  three  four
SH    12   11     13    12
SZ    13   12     12    11
GZ    14   10     11    11
NaN   12   11     12    10

#### 3.1 针对索引排序

In [71]:
data.sort_index()

     one  two  three  four
GZ     8    9     10    11
SH     0    1      2     3
SZ     4    5      6     7
NaN   12   13     14    15

In [70]:
data.sort_index(axis=0,ascending=False,na_position='first')

     one  two  three  four
NaN   12   13     14    15
SZ     4    5      6     7
SH     0    1      2     3
GZ     8    9     10    11

#### 基于values排序

In [73]:
data.sort_values(by='four')#基于‘four’列进行升序排列

     one  two  three  four
SH     0    1      2     3
SZ     4    5      6     7
GZ     8    9     10    11
NaN   12   13     14    15

In [74]:
data.sort_values(by='four',ascending=False)#基于‘four’列进行降序排列

     one  two  three  four
NaN   12   13     14    15
GZ     8    9     10    11
SZ     4    5      6     7
SH     0    1      2     3

In [79]:
data.sort_values(by=['four','three'])

     one  two  three  four
NaN   12   11     12    10
GZ    14   10     11    11
SZ    13   12     12    11
SH    12   11     13    12

In [83]:
data.sort_values(by='three').sort_values(by=['four'],ascending=False)

     one  two  three  four
SH    12   11     13    12
GZ    14   10     11    11
SZ    13   12     12    11
NaN   12   11     12    10

### 4. 数据合并

+ merge:基于指定key进行数据合并
+ concat:沿着指定轴，对进行数据拼接
+ combine_first:打补丁，可以将重复数据拼接在一起，用一个对象中的值填充另一个对象中的缺失值

#### 4.1 merge()

In [84]:
df1 = pd.DataFrame({'key1':['foo','bar','baz','foo'],'data1':list(np.arange(1,5))})
df2 = pd.DataFrame({'key1':['foo','bar','qux','bar'],'data2':list(np.arange(5,9))})

In [85]:
print(df1)
print(df2)

  key1  data1
0  foo      1
1  bar      2
2  baz      3
3  foo      4
  key1  data2
0  foo      5
1  bar      6
2  qux      7
3  bar      8

In [90]:
df1.merge(df2,left_on='key1',right_on='key1',how='left')#inner:内联;outer:外联；left:左联;右联：right

  key1  data1  data2
0  foo      1    5.0
1  bar      2    6.0
2  bar      2    8.0
3  baz      3    NaN
4  foo      4    5.0

In [93]:
df1.merge(df2,on='key1',how='outer')#如果合并时，两个表合并的列名是一样，用on

  key1  data1  data2
0  bar    2.0    6.0
1  bar    2.0    8.0
2  baz    3.0    NaN
3  foo    1.0    5.0
4  foo    4.0    5.0
5  qux    NaN    7.0

In [94]:
left1=pd.DataFrame({'key':['a','c','b','c'],'value1':[1,2,3,4],'value2':[4,5,6,7]},index=['a','b','c','e'])
right1=pd.DataFrame([[7,8],[9,10],[11,12],[13,14]],index=['b','c','d','a'],columns=['value3','value4'])
print(left1)
print(right1)

  key  value1  value2
a   a       1       4
b   c       2       5
c   b       3       6
e   c       4       7
   value3  value4
b       7       8
c       9      10
d      11      12
a      13      14

In [95]:
left1.merge(right1,left_index=True,right_index=True)

  key  value1  value2  value3  value4
a   a       1       4      13      14
b   c       2       5       7       8
c   b       3       6       9      10

In [96]:
left1.merge(right1,left_on=['key'],right_index=True)

  key  value1  value2  value3  value4
a   a       1       4      13      14
b   c       2       5       9      10
e   c       4       7       9      10
c   b       3       6       7       8

#### 3.2 concat

In [100]:
s1 = pd.Series(np.arange(5))
s2 = pd.Series(np.random.randint(1,10,5),index=[0,1,2,4,8])
print(s1)
print(s2)

0    0
1    1
2    2
3    3
4    4
dtype: int32
0    3
1    9
2    1
4    4
8    8
dtype: int32

In [98]:
pd.concat([s1,s2],axis=0)

0    0
1    1
2    2
3    3
4    4
0    9
1    4
2    3
3    3
4    3
dtype: int32

In [101]:
pd.concat([s1,s2],axis=1)

     0    1
0  0.0  3.0
1  1.0  9.0
2  2.0  1.0
3  3.0  NaN
4  4.0  4.0
8  NaN  8.0

In [107]:
df1 = pd.DataFrame([['a', 1], ['b', 2]],index=[0,4],columns=['letter', 'number'])
df2 = pd.DataFrame([['c', 3], ['d', 4]],columns=['number','letter1'])
print(df1)
print(df2)

  letter  number
0      a       1
4      b       2
  number  letter1
0      c        3
1      d        4

In [109]:
pd.concat([df1,df2],sort=True,axis=0)

  letter  letter1 number
0      a      NaN      1
4      b      NaN      2
0    NaN      3.0      c
1    NaN      4.0      d

#### 3.3 combine_first：合并重叠数据

In [110]:
df1 = pd.DataFrame({'a':[1,np.nan,5.,np.nan],'b':[np.nan,2,np.nan,6],'c':list(np.arange(2,18,4))})
df2 = pd.DataFrame({'a':[5,4,np.nan,3,7],'b':[np.nan,3,4,6,8]})
print(df1)
print(df2)

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14
     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [111]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN